{
	"intro": {
		"text": "Welcome to Glitch City, a sprawling metropolis shrouded in secrecy and corporate intrigue. In the heart of this enigmatic city lies the Glitch Palace, a hub of technological innovation where Layla's father, a renowned scientist, once worked. Layla, a young and determined woman, arrives in Glitch City following the mysterious death of her beloved father. Known for his groundbreaking discoveries in technology, Layla's father was on the brink of uncovering a revolutionary new technology before his untimely demise. Determined to unravel the truth behind her father's death and the secrets hidden within Glitch City, Layla embarks on a perilous journey. As Layla navigates the labyrinthine streets of Glitch City, she encounters a web of conspiracies, elusive clues, and unexpected allies. With your guidance, Layla will uncover the dark secrets of Glitch City and confront the forces that seek to control its destiny.",
		"ris": ["Join Layla in her quest for truth.", "Stay out of Layla's affairs."],
		"nextLev": ["level1", "end"]
	},
	"level1": {
		"text": "Layla stands before the towering gates of Glitch City, a metropolis veiled in mystery. With a heavy heart for her father's loss, she decides to venture into the city to uncover the truth. Before her lies a maze of neon lights and towering skyscrapers. What's her first move?",
		"ris": [
			"Head towards the Glitch Palace to search for clues about her father.",
			"Explore the outskirts to gather information from the locals."
		],
		"nextLev": ["level2A", "level2B"]
	},
	"level2A": {
		"text": "Layla makes her way towards the Glitch Palace, the epicenter of technological advancement in Glitch City. As she approaches, she notices the imposing structure looming over her. However, the palace is heavily guarded, and gaining access won't be easy. What does Layla do?",
		"ris": [
			"Attempt to sneak past the guards and infiltrate the palace.",
			"Seek out an alternative route or find someone who can help her gain entry."
		],
		"nextLev": ["level3A1", "level3A2"]
	},
	"level2B": {
		"text": "Layla decides to explore the outskirts of Glitch City, hoping to gather information from the locals. As she wanders through the dimly lit streets, she comes across a group of street vendors. Perhaps they hold the key to uncovering the truth about her father's death. What does Layla do?",
		"ris": [
			"Approach the street vendors and ask if they have any information about her father.",
			"Continue exploring the outskirts and look for other sources of information."
		],
		"nextLev": ["level3B1", "level3B2"]
	},
	"level3A1": {
		"text": "Layla attempts to sneak past the guards, using her stealth skills to evade detection. She moves quietly through the shadows, careful to avoid any patrols. However, her luck runs out as she is spotted by a security drone. With alarms blaring, Layla must act quickly to avoid capture. What does she do?",
		"ris": [
			"Fight her way past the guards and continue towards the palace.",
			"Retreat and regroup, seeking another opportunity to infiltrate the palace."
		],
		"nextLev": ["level4A1", "level2A"]
	},
	"level3A2": {
		"text": "Layla decides to seek out an alternative route or find someone who can help her gain entry to the Glitch Palace. She begins to scour the streets for potential allies or hidden entrances. After hours of searching, she finally comes across a group of underground hackers who claim they can help her. What does Layla do?",
		"ris": [
			"Accept the hackers' help and follow their lead to infiltrate the palace.",
			"Decline the offer and continue searching for another way to access the palace."
		],
		"nextLev": ["level4A2", "level2A"]
	},
	"level3B1": {
		"text": "Approaching the street vendors, Layla cautiously asks if they have any information about her father. The vendors exchange nervous glances before one of them speaks up. They claim to have heard rumors about Layla's father and offer to share what they know in exchange for a favor. What does Layla do?",
		"ris": [
			"Agree to help the street vendors in exchange for information about her father.",
			"Refuse the offer and try to obtain information through other means."
		],
		"nextLev": ["level4B1", "level2B"]
	},
	"level3B2": {
		"text": "Deciding to continue exploring the outskirts, Layla hopes to find other sources of information about her father. She wanders through the streets, keeping her eyes and ears open for any clues. Eventually, she stumbles upon an old bookstore with a sign that reads 'Secrets of Glitch City.' Could this be the key to unlocking the truth? What does Layla do?",
		"ris": [
			"Enter the bookstore and search for information about her father.",
			"Ignore the bookstore and keep searching for other sources of information."
		],
		"nextLev": ["level4B2", "level2B"]
	},
	"level4A1": {
		"text": "Facing off against the guards, Layla fights with all her strength and determination. Despite being outnumbered, she manages to hold her own, taking down several guards before making a daring escape. As she flees, Layla vows to return to the Glitch Palace and uncover the truth, no matter the cost.",
		"ris": ["Continue", ""],
		"nextLev": ["level5A1"]
	},
	"level4A2": {
		"text": "Accepting the hackers' help, Layla follows their lead as they guide her through hidden passageways and security blind spots. With their expertise, she manages to bypass the palace's defenses and gain entry without raising suspicion. Inside, Layla begins her search for clues about her father's research and the circumstances of his death.",
		"ris": ["Continue", ""],
		"nextLev": ["level5A2"]
	},
	"level4B1": {
		"text": "Agreeing to help the street vendors, Layla fulfills their request, which involves retrieving a valuable item from a rival gang's hideout. With determination and resourcefulness, she successfully completes the task and returns to collect the promised information. The vendors provide Layla with valuable insights into her father's work and the dangers he faced. Armed with this new knowledge, Layla sets out to uncover the truth once and for all.",
		"ris": ["Continue", ""],
		"nextLev": ["level5B1"]
	},
	"level4B2": {
		"text": "Entering the bookstore, Layla discovers a treasure trove of information about Glitch City's history and secrets. Among the dusty shelves, she finds references to her father's research and the technology he was developing. With each page she turns, Layla feels closer to uncovering the truth about her father's death. Armed with newfound knowledge, Layla leaves the bookstore with a renewed sense of purpose and determination.",
		"ris": ["Continue", ""],
		"nextLev": ["level5B2"]
	},
	"level5A1": {
		"text": "Having successfully fought her way past the guards, Layla emerges from the Glitch Palace's security perimeter and begins her search for clues. Inside the palace, she finds evidence of her father's research and the groundbreaking technology he was developing. However, her investigation is cut short as she is confronted by a group of security personnel. What does Layla do?",
		"ris": [
			"Attempt to reason with the security personnel and convince them to let her continue her investigation.",
			"Fight her way out of the palace and escape to regroup and plan her next move."
		],
		"nextLev": ["level6A1", "level6A2"]
	},
	"level5A2": {
		"text": "With the help of the hackers, Layla gains access to the inner workings of the Glitch Palace. Inside, she discovers a hidden laboratory where her father conducted his research. Among the equipment and documents, Layla finds clues that lead her to uncover a shocking conspiracy. Before she can fully comprehend the magnitude of her discovery, she is interrupted by the arrival of security personnel. What does Layla do?",
		"ris": [
			"Confront the security personnel and demand answers about her father's research and his untimely death.",
			"Attempt to escape from the palace and regroup to plan her next course of action."
		],
		"nextLev": ["level6A3", "level6A4"]
	},
	"level5B1": {
		"text": "Armed with the information provided by the street vendors, Layla delves deeper into her father's research and the secrets of Glitch City. With each piece of the puzzle she uncovers, Layla gets closer to unraveling the truth about her father's death. However, her investigation attracts unwanted attention, and she finds herself pursued by mysterious agents. What does Layla do?",
		"ris": [
			"Evade her pursuers and continue her investigation, determined to uncover the truth no matter the risks.",
			"Go into hiding to regroup and plan her next move, wary of the dangers lurking in the shadows."
		],
		"nextLev": ["level6B1", "level6B2"]
	},
	"level5B2": {
		"text": "Leaving the bookstore with a wealth of knowledge, Layla feels more determined than ever to uncover the truth about her father's death. Armed with the information she gathered, Layla sets out to confront the individuals responsible for her father's demise. However, her investigation leads her into a dangerous game of cat and mouse, where the stakes are higher than she ever imagined. What does Layla do?",
		"ris": [
			"Face her adversaries head-on and confront them about their involvement in her father's death.",
			"Retreat and regroup, seeking allies and resources to take on the powerful forces working against her."
		],
		"nextLev": ["level6B3", "level6B4"]
	},
	"level6A1": {
		"text": "Layla attempts to reason with the security personnel, hoping to convince them to let her continue her investigation. She pleads her case, explaining the importance of uncovering the truth about her father's research and his untimely death. To her surprise, the security personnel agree to assist Layla in her investigation, revealing shocking revelations about the true nature of the Glitch Palace and its inhabitants.",
		"ris": ["Continue", ""],
		"nextLev": ["level7A1"]
	},
	"level6A2": {
		"text": "Refusing to back down, Layla fights her way out of the palace, using her skills and determination to overcome any obstacles in her path. Despite facing fierce resistance, Layla manages to escape the Glitch Palace and disappear into the shadows of Glitch City. With the information she obtained, Layla begins to piece together the puzzle of her father's death and the secrets hidden within Glitch City.",
		"ris": ["Continue", ""],
		"nextLev": ["level7A2"]
	},
	"level6A3": {
		"text": "Confronting the security personnel, Layla demands answers about her father's research and his untimely death. However, her interrogation is cut short as reinforcements arrive, forcing Layla to fight her way out of the palace. Despite facing overwhelming odds, Layla manages to escape and continues her investigation into the conspiracy that led to her father's demise.",
		"ris": ["Continue", ""],
		"nextLev": ["level7A3"]
	},
	"level6A4": {
		"text": "Realizing the danger of staying in the palace, Layla attempts to escape and regroup to plan her next course of action. Despite facing numerous obstacles and challenges, Layla manages to evade capture and disappears into the shadows of Glitch City. With the information she obtained, Layla begins to uncover the truth about her father's death and the dark secrets hidden within Glitch City.",
		"ris": ["Continue", ""],
		"nextLev": ["level7A4"]
	},
	"level6B1": {
		"text": "Evading her pursuers, Layla continues her investigation into her father's death and the secrets of Glitch City. With each step she takes, Layla gets closer to uncovering the truth behind the conspiracy that led to her father's demise. However, her pursuit of justice attracts the attention of powerful individuals who will stop at nothing to silence her. What does Layla do?",
		"ris": [
			"Continue her investigation, risking everything to uncover the truth no matter the cost.",
			"Go into hiding and seek allies to help her take on the powerful forces working against her."
		],
		"nextLev": ["level7B1", "level7B2"]
	},
	"level6B2": {
		"text": "Choosing to go into hiding, Layla seeks refuge in the shadows of Glitch City, wary of the dangers lurking around every corner. Despite the risks, Layla continues her investigation into her father's death, determined to uncover the truth no matter the obstacles in her path. With each passing day, Layla gets closer to unraveling the conspiracy that led to her father's demise.",
		"ris": ["Continue", ""],
		"nextLev": ["level7B3"]
	},
	"level6B3": {
		"text": "Facing her adversaries head-on, Layla confronts them about their involvement in her father's death. Despite their attempts to intimidate her, Layla stands her ground, refusing to back down in the face of danger. With determination and courage, Layla exposes the truth about her father's death and the dark secrets hidden within Glitch City, bringing those responsible to justice.",
		"ris": ["Continue", ""],
		"nextLev": ["level7B4"]
	},
	"level6B4": {
		"text": "Retreating and regrouping, Layla seeks allies and resources to take on the powerful forces working against her. With each ally she gains and every resource she acquires, Layla gets closer to unraveling the conspiracy that led to her father's demise. Armed with newfound allies and determination, Layla prepares to confront those responsible and uncover the truth about her father's death.",
		"ris": ["Continue", ""],
		"nextLev": ["level7B5"]
	},
	"level7A1": {
		"text": "With the assistance of the security personnel, Layla delves deeper into the secrets of the Glitch Palace and uncovers shocking revelations about her father's research. Together, they uncover a conspiracy that stretches far beyond Glitch City, implicating powerful individuals with a vested interest in controlling the city's destiny. With the truth exposed, Layla prepares to confront those responsible and bring them to justice.",
		"ris": ["Continue", ""],
		"nextLev": ["level8A1"]
	},
	"level7A2": {
		"text": "Having escaped the Glitch Palace, Layla disappears into the shadows of Glitch City, determined to uncover the truth about her father's death. With the information she obtained, Layla begins to unravel a conspiracy that stretches far beyond Glitch City, implicating powerful individuals with a vested interest in controlling the city's destiny. With newfound allies and determination, Layla prepares to confront those responsible and bring them to justice.",
		"ris": ["Continue", ""],
		"nextLev": ["level8A2"]
	},
	"level7A3": {
		"text": "Despite facing overwhelming odds, Layla manages to escape from the Glitch Palace and continues her investigation into her father's death. With each piece of the puzzle she uncovers, Layla gets closer to unraveling the conspiracy that led to her father's demise. Armed with determination and courage, Layla prepares to confront those responsible and uncover the truth about her father's death.",
		"ris": ["Continue", ""],
		"nextLev": ["level8A3"]
	},
	"level7A4": {
		"text": "Having escaped from the Glitch Palace, Layla disappears into the shadows of Glitch City, determined to uncover the truth about her father's death. With the information she obtained, Layla begins to unravel a conspiracy that stretches far beyond Glitch City, implicating powerful individuals with a vested interest in controlling the city's destiny. With newfound allies and determination, Layla prepares to confront those responsible and bring them to justice.",
		"ris": ["Continue", ""],
		"nextLev": ["level8A4"]
	},
	"level7B1": {
		"text": "Continuing her investigation, Layla risks everything to uncover the truth about her father's death and the secrets of Glitch City. With each revelation, Layla gets closer to unraveling the conspiracy that led to her father's demise. However, her pursuit of justice attracts the attention of powerful individuals who will stop at nothing to silence her. What does Layla do?",
		"ris": [
			"Continue her investigation, determined to bring those responsible to justice no matter the risks.",
			"Go into hiding and seek allies to help her take on the powerful forces working against her."
		],
		"nextLev": ["level8B1", "level8B2"]
	},
	"level7B2": {
		"text": "Choosing to go into hiding, Layla seeks refuge in the shadows of Glitch City, wary of the dangers lurking around every corner. Despite the risks, Layla continues her investigation into her father's death, determined to uncover the truth no matter the obstacles in her path. With each passing day, Layla gets closer to unraveling the conspiracy that led to her father's demise.",
		"ris": ["Continue", ""],
		"nextLev": ["level8B3"]
	},
	"level7B3": {
		"text": "Facing her adversaries head-on, Layla confronts them about their involvement in her father's death. Despite their attempts to intimidate her, Layla stands her ground, refusing to back down in the face of danger. With determination and courage, Layla exposes the truth about her father's death and the dark secrets hidden within Glitch City, bringing those responsible to justice.",
		"ris": ["Continue", ""],
		"nextLev": ["level8B4"]
	},
	"level7B4": {
		"text": "Retreating and regrouping, Layla seeks allies and resources to take on the powerful forces working against her. With each ally she gains and every resource she acquires, Layla gets closer to unraveling the conspiracy that led to her father's demise. Armed with newfound allies and determination, Layla prepares to confront those responsible and uncover the truth about her father's death.",
		"ris": ["Continue", ""],
		"nextLev": ["level8B5"]
	},
	"level8A1": {
		"text": "With the truth exposed, Layla prepares to confront those responsible for her father's death and the secrets of Glitch City. Armed with determination and courage, Layla faces off against powerful adversaries who will stop at nothing to protect their interests. In a final showdown, Layla emerges victorious, bringing justice to her father and peace to Glitch City.",
		"ris": ["Continue", ""],
		"nextLev": ["level9A1"]
	},
	"level8A2": {
		"text": "With newfound allies and determination, Layla prepares to confront those responsible for her father's death and the secrets of Glitch City. Armed with courage and resilience, Layla faces off against powerful adversaries who will stop at nothing to protect their interests. In a final showdown, Layla emerges victorious, bringing justice to her father and peace to Glitch City.",
		"ris": ["Continue", ""],
		"nextLev": ["level9A2"]
	},
	"level8A3": {
		"text": "Armed with determination and courage, Layla prepares to confront those responsible for her father's death and the secrets of Glitch City. Despite facing overwhelming odds, Layla refuses to back down, determined to bring justice to her father and peace to Glitch City. In a final showdown, Layla emerges victorious, exposing the truth and bringing those responsible to justice.",
		"ris": ["Continue", ""],
		"nextLev": ["level9A3"]
	},
	"level8A4": {
		"text": "With newfound allies and determination, Layla prepares to confront those responsible for her father's death and the secrets of Glitch City. Armed with courage and resilience, Layla faces off against powerful adversaries who will stop at nothing to protect their interests. In a final showdown, Layla emerges victorious, bringing justice to her father and peace to Glitch City.",
		"ris": ["Continue", ""],
		"nextLev": ["level9A4"]
	},
	"level8B1": {
		"text": "Continuing her investigation, Layla risks everything to uncover the truth about her father's death and the secrets of Glitch City. With each revelation, Layla gets closer to unraveling the conspiracy that led to her father's demise. However, her pursuit of justice attracts the attention of powerful individuals who will stop at nothing to silence her. What does Layla do?",
		"ris": [
			"Continue her investigation, determined to bring those responsible to justice no matter the risks.",
			"Go into hiding and seek allies to help her take on the powerful forces working against her."
		],
		"nextLev": ["level9B1", "level9B2"]
	},
	"level8B2": {
		"text": "Choosing to go into hiding, Layla seeks refuge in the shadows of Glitch City, wary of the dangers lurking around every corner. Despite the risks, Layla continues her investigation into her father's death, determined to uncover the truth no matter the obstacles in her path. With each passing day, Layla gets closer to unraveling the conspiracy that led to her father's demise.",
		"ris": ["Continue", ""],
		"nextLev": ["level9B3"]
	},
	"level8B3": {
		"text": "Facing her adversaries head-on, Layla confronts them about their involvement in her father's death. Despite their attempts to intimidate her, Layla stands her ground, refusing to back down in the face of danger. With determination and courage, Layla exposes the truth about her father's death and the dark secrets hidden within Glitch City, bringing those responsible to justice.",
		"ris": ["Continue", ""],
		"nextLev": ["level9B4"]
	},
	"level8B4": {
		"text": "Retreating and regrouping, Layla seeks allies and resources to take on the powerful forces working against her. With each ally she gains and every resource she acquires, Layla gets closer to unraveling the conspiracy that led to her father's demise. Armed with newfound allies and determination, Layla prepares to confront those responsible and uncover the truth about her father's death.",
		"ris": ["Continue", ""],
		"nextLev": ["level9B5"]
	},
	"level9A1": {
		"text": "With justice served and the truth revealed, Layla emerges as a hero of Glitch City, hailed for her courage and determination. As the city celebrates its newfound freedom, Layla reflects on her journey and the sacrifices made along the way. With her father's legacy honored and the secrets of Glitch City laid bare, Layla looks to the future with hope and optimism.",
		"ris": ["Continue", ""],
		"nextLev": ["end"]
	},
	"level9A2": {
		"text": "With justice served and the truth revealed, Layla emerges as a hero of Glitch City, hailed for her courage and determination. As the city celebrates its newfound freedom, Layla reflects on her journey and the sacrifices made along the way. With her father's legacy honored and the secrets of Glitch City laid bare, Layla looks to the future with hope and optimism.",
		"ris": ["Continue", ""],
		"nextLev": ["end"]
	},
	"level9A3": {
		"text": "With justice served and the truth revealed, Layla emerges as a hero of Glitch City, hailed for her courage and determination. As the city celebrates its newfound freedom, Layla reflects on her journey and the sacrifices made along the way. With her father's legacy honored and the secrets of Glitch City laid bare, Layla looks to the future with hope and optimism.",
		"ris": ["Continue", ""],
		"nextLev": ["end"]
	},
	"level9A4": {
		"text": "With justice served and the truth revealed, Layla emerges as a hero of Glitch City, hailed for her courage and determination. As the city celebrates its newfound freedom, Layla reflects on her journey and the sacrifices made along the way. With her father's legacy honored and the secrets of Glitch City laid bare, Layla looks to the future with hope and optimism.",
		"ris": ["Continue", ""],
		"nextLev": ["end"]
	},
	"level8B5": {
		"text": "With justice served and the truth revealed, Layla emerges as a hero of Glitch City, hailed for her courage and determination. As the city celebrates its newfound freedom, Layla reflects on her journey and the sacrifices made along the way. With her father's legacy honored and the secrets of Glitch City laid bare, Layla looks to the future with hope and optimism.",
		"ris": ["Continue", ""],
		"nextLev": ["end"]
	},
	"level9B1": {
		"text": "With justice served and the truth revealed, Layla emerges as a hero of Glitch City, hailed for her courage and determination. As the city celebrates its newfound freedom, Layla reflects on her journey and the sacrifices made along the way. With her father's legacy honored and the secrets of Glitch City laid bare, Layla looks to the future with hope and optimism.",
		"ris": ["Continue", ""],
		"nextLev": ["end"]
	},
	"level9B2": {
		"text": "With justice served and the truth revealed, Layla emerges as a hero of Glitch City, hailed for her courage and determination. As the city celebrates its newfound freedom, Layla reflects on her journey and the sacrifices made along the way. With her father's legacy honored and the secrets of Glitch City laid bare, Layla looks to the future with hope and optimism.",
		"ris": ["Continue", ""],
		"nextLev": ["end"]
	},
	"level9B3": {
		"text": "With justice served and the truth revealed, Layla emerges as a hero of Glitch City, hailed for her courage and determination. As the city celebrates its newfound freedom, Layla reflects on her journey and the sacrifices made along the way. With her father's legacy honored and the secrets of Glitch City laid bare, Layla looks to the future with hope and optimism.",
		"ris": ["Continue", ""],
		"nextLev": ["end"]
	},
	"level9B4": {
		"text": "With justice served and the truth revealed, Layla emerges as a hero of Glitch City, hailed for her courage and determination. As the city celebrates its newfound freedom, Layla reflects on her journey and the sacrifices made along the way. With her father's legacy honored and the secrets of Glitch City laid bare, Layla looks to the future with hope and optimism.",
		"ris": ["Continue", ""],
		"nextLev": ["end"]
	},
	"level9B5": {
		"text": "With justice served and the truth revealed, Layla emerges as a hero of Glitch City, hailed for her courage and determination. As the city celebrates its newfound freedom, Layla reflects on her journey and the sacrifices made along the way. With her father's legacy honored and the secrets of Glitch City laid bare, Layla looks to the future with hope and optimism.",
		"ris": ["Continue", ""],
		"nextLev": ["end"]
	},
	"end": {
		"text": "Congratulations! You've guided Layla through the twists and turns of Glitch City, helping her uncover the truth about her father's death and the secrets hidden within the city. With justice served and peace restored to Glitch City, Layla's journey comes to an end. Thank you for joining us on this adventure!",
		"ris": ["Thanks for playing", ""]
	}
}
